tap "withgraphite/tap"
tap "zhimoe/fonts"

brew "ccat"
brew "fish"
brew "gh"
brew "git"
brew "gitleaks"
brew "jq"
brew "mas"
brew "mole"
brew "pre-commit"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "streamlink"
brew "tree"

cask "1password"
cask "arc"
cask "codex-app"
cask "conductor"
cask "cursor"
cask "google-chrome"
cask "ghostty"
cask "imageoptim"
cask "monitorcontrol"
cask "postgres-app"
cask "postico"
cask "raycast"
cask "slack"
cask "spotify"
cask "thebrowsercompany-dia"
cask "warp"
cask "zed@preview"
cask "zoom"

cask "font-geist"
cask "font-geist-mono"
cask "font-ibm-plex-mono"
cask "font-inter"
cask "font-iosevka"
cask "zhimoe/fonts/ioskeley-mono"
